onec-mid-base-11/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ЗадолженностьПокупателей</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  
<attributes>
    <name>Расш1_КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.Расш1_КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Расш1_СогласованнаяСкидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

onec-mid-base-11/src/Documents/ЗаказПокупателя/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
	
	//++Юра 22.04.2026 Вывод реквизитов на форму
	Расш1_ДоработкиФорм.ДобавитьПолеКонтактноеЛицо(ЭтотОбъект);
	Расш1_ДоработкиФорм.ДобавитьПолеСогласованнаяСкидка(ЭтотОбъект);
	//--
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

//++Юра 22.04.2026
// Проверка превышения максимальной скидки (99%) при изменении согласованной скидки
// и запрос подтверждения пересчета сумм документа
//
&НаКлиенте
Процедура Подключаемый_Расш1_СогласованнаяСкидкаПриИзменении(Элемент)

	ТаблицаНеПустая = Объект.Товары.Количество() > 0 ИЛИ Объект.Услуги.Количество() > 0;

      // Проверка на превышение максимальной скидки
      Если ТаблицаНеПустая Тогда

          ЕстьПревышение = Ложь;

          Для Каждого СтрокаТовара Из Объект.Товары Цикл
              Если Объект.Расш1_СогласованнаяСкидка + СтрокаТовара.Скидка > 99 Тогда
                  ЕстьПревышение = Истина;
                  Прервать;
              КонецЕсли;
          КонецЦикла;

          Если НЕ ЕстьПревышение Тогда
              Для Каждого СтрокаУслуги Из Объект.Услуги Цикл
                  Если Объект.Расш1_СогласованнаяСкидка + СтрокаУслуги.Скидка > 99 Тогда
                      ЕстьПревышение = Истина;
                      Прервать;
                  КонецЕсли;
              КонецЦикла;
		  КонецЕсли;
		  
		  ОписаниеОповещения = Новый ОписаниеОповещения(
		  "Расш1_СогласованнаяСкидкаПриИзмененииЗавершение", ЭтотОбъект, ЕстьПревышение);
		  
		  ПоказатьВопрос(ОписаниеОповещения,
		  "Пересчитать суммы в табличных частях с учётом новой скидки?",
		  РежимДиалогаВопрос.ДаНет);
		  
	  КонецЕсли;

КонецПроцедуры
//--Юра 20.02.2026

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//++ Юра 22.04.2026
// Обработчик ответа пользователя на вопрос о пересчете сумм документа
// Параметры:
//   Результат - КодВозвратаДиалога - выбор пользователя
//   ДополнительныеПараметры - Булево - содержит ключ "ЕстьПревышение" 
//
&НаКлиенте
Процедура Расш1_СогласованнаяСкидкаПриИзмененииЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		Если ДополнительныеПараметры Тогда
		Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = "Есть превышение максимальной скидки";
        Сообщение.Сообщить();
		КонецЕсли;

		Расш1_ПересчитатьТабличныеЧастиПоСкидке();

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные)
	
	//++Юра 22.04.2026	
	//КоэффициентСкидки = 1 - ТекущиеДанные.Скидка / 100;
	//ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество * КоэффициентСкидки;
	
	Расш1_РассчитатьСуммуСтрокиТЧ(ТекущиеДанные, Объект.Расш1_СогласованнаяСкидка);
	//--Юра 22.04.2026	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

//++Юра 22.04.2026	
&НаКлиенте
Процедура Расш1_ПересчитатьТабличныеЧастиПоСкидке()

	Для Каждого СтрокаТовара Из Объект.Товары Цикл
          Расш1_РассчитатьСуммуСтрокиТЧ(СтрокаТовара, Объект.Расш1_СогласованнаяСкидка);
      КонецЦикла;

      Для Каждого СтрокаУслуги Из Объект.Услуги Цикл
          Расш1_РассчитатьСуммуСтрокиТЧ(СтрокаУслуги, Объект.Расш1_СогласованнаяСкидка);
      КонецЦикла;

      РассчитатьСуммуДокумента();

КонецПроцедуры

 &НаКлиенте
Процедура Расш1_РассчитатьСуммуСтрокиТЧ(СтрокаТЧ, СкидкаШапки)

      // Суммируем скидки, но не более 100%
      ОбщаяСкидка = Мин(СкидкаШапки + СтрокаТЧ.Скидка, 100);
      КоэффициентСкидки = 1 - ОбщаяСкидка / 100;

      СтрокаТЧ.Сумма = СтрокаТЧ.Цена * СтрокаТЧ.Количество * КоэффициентСкидки;
	  
КонецПроцедуры
//--Юра 22.04.2026
#КонецОбласти

//@skip-check module-structure-top-region
#Область ОбработчикиКомандФормы

//++Юра 20.02.2026
&НаКлиенте
Процедура Расш1_ПересчитатьПоСкидке(Команда)

	Расш1_ПересчитатьТабличныеЧастиПоСкидке();

КонецПроцедуры
//--Юра 20.02.2026

#КонецОбласти
